README.md

# Table of Contents

1.  [Manual](#org1033398)
    1.  [Pipenv](#org76cb8b8)
    2.  [Como rodar esse projeto](#org1148a34)

+TITLE: Music REST


<a id="org1033398"></a>

# Manual

O app tem os seguintes tecnologias que precisam ser instaladas.

-   Flask
-   Flask-Restx
-   flask Marshmallow


<a id="org76cb8b8"></a>

## Pipenv

Para instalar todas essas tecnologias sem dificuldades, há um arquivo chamado pipfile, ele é o arquivo que declara todos os pacotes.

Pipenv é um gerenciador e ambientes virtuais python.

Instale ele atráves do seu gerenciador de pacotes ou atraves do pip install

    pip install pipenv

Apos instalar abre o terminal nesta pasta onde se encotra esse readme e execute.

    pipenv install --dev


<a id="org1148a34"></a>

## Como rodar esse projeto

Exporte esses comandos de dentro do ambiente virtual e execute python3.

    python3 main.py

